import styles from "./Legend.module.scss";
import { useSelector } from "react-redux";

export default function Legend() {
  const language = useSelector((store) => {
    return store.languageReducer;
  });
  return (
    <div className={styles.back}>
      <div className={styles.container}>
        <div className={styles.block}>
          {language === "rus" && (
            <h2 className={styles.title}>
              Широкий ассортимент и высокое качество
            </h2>
          )}
          {language === "ukr" && (
            <h2 className={styles.title}>
              Широкий асортимент та висока якість
            </h2>
          )}
          {language === "rus" && (
            <p className={styles.text}>
              Интернет-магазин PlaceMik – это доступные цены, широкий, регулярно
              обновляемый ассортимент. В онлайн-каталоге PlaceMik представлено
              около 35 000 ведущих брендов женской, мужской и детской одежды и
              обуви. Покупателям предлагается электроника, книжная продукция,
              детские товары. В интернет-магазине можно приобрести продукцию для
              дома, продукты питания, товары для красоты, ювелирные изделия,
              игрушки. Для удобства пользования онлайн-каталог поделен на
              разделы.
            </p>
          )}
          {language === "ukr" && (
            <p className={styles.text}>
              Інтернет-магазин PlaceMik – це доступні ціни, широкий, регулярно
              оновлюваний асортимент. В онлайн-каталозі PlaceMik представлено
              близько 35 000 провідних брендів жіночого, чоловічого та дитячого
              одягу та взуття. Покупцям пропонується електроніка, книжкова
              продукція, дитячі товари. В інтернет-магазині можна придбати
              продукцію для дому, продукти харчування, товари для краси,
              ювелірні вироби, іграшки. Для зручності користування
              онлайн-каталог поділено на розділи.
            </p>
          )}
        </div>
      </div>
    </div>
  );
}
